# TODO 1.Сделать получение индустрии и специализации вакансии с помощью отдельных функций
# TODO 2.Сделать получение датасета с максимально возможным количеством признаков. Для этого сделать отдельную функцию.
# TODO 3.Сделать сохранение полученной информации в базу данных на диске.
# TODO 4.Сделать получение датасета за определенный срок(день,3 дня,неделя,месяц)
# TODO 5. Сделать сохранение полученного датасета за определенный срок в базу данных.
# TODO 6. Сделать автоматический запуск скрипта.
# TODO 7. Сделать минимальный интерфейс(возможность выбора региона и даты)
# TODO 8. Сделать базовый пайплайн процесса визуализации.
# TODO 9. Сделать базовый пайплан машинного обучения на базе полученных данных.
# TODO 10. Сделать автоматическое выполнение процесса визуализации.
# TODO 11. Сделать размещение полученных результатов на сайте ЦОПП.
# TODO 12. Сделать полностью автоматическим весь процесс получения,базового анализа,визуализации и размещения на сайте.
# TODO 13. Написать тесты pytest покрывающие весь процесс.
# TODO 14. Подготовить документацию.
